Revit 2027 API
DGNImportOptions.DGNModelViewName Property
 The model view name to be imported. Need user give a model view name to specify which model view need to be imported into Revit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DGNModelViewName { get; set; }
Public Property DGNModelViewName As String
	Get
	Set
public:
property String^ DGNModelViewName {
	String^ get ();
	void set (String^ value);
}
member DGNModelViewName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DGNImportOptions Class
Autodesk.Revit.DB Namespace